<!--
https://php.apartner.pro/Urok-8.html

1) Оголошення та виклик функції з іменем myFunc +
2) Створити функцію з іменем calc , яка буде приймати три параметри , третій параметр буде не обовязковим. У функції+
викликати перевірку на наявність третього параметру. Отримати результат усіх введених параметрів.+
3) Напишіть функцію, яка приймала будь-яке слово (введене користувачем) та виводило його.+
4) Напишіть функцію PHP, яка приймає один аргумент та виводить слово "Hello" разом з текстом, який був передано.+
5) Напишіть функцію PHP, яка приймала будь-яку к-сть аргументiв і виводила їх.+
6) Напишіть функцію яка буде отримувати два масива. Потрібно зробити перевірку на отримання саме двох масивів. Об'єднати
два масива і вивести результат у виді нового масиву.

7) Напишіть функцію PHP, яка приймає два значення та лінк який переданий за допомогою посилання. Змінити зміну , яка
передана в третьому аргументі. Вивести усі зміні.


8) Створити глобальну зміну у функції. Змінити глобальну зміну поза межами функції і вивести її. Викликати функцію в
якій створили глобальну зміну. Вивести рельтат зміної після викликаної функції.

9) Створити статичну зміну у функції і її результат буде плюсуватися відповідно від того скільки разів буде викликана
функція. Викликати функцію 10 разів , на 7 кроці змінити статичну зміну у функції на значення 0.

10) Створити функцію , яка буде отримувати 5 параметрів і в ретурні має створюватись масив з усіма введенними
параметрами. Результат вивести через print_r , var_dump.

11) Написати рекурсивну функцію для обчислення суми послідовності цілих чисел. Функція повинна приймати масив як
аргумент, та повертати суму всього масиву.

12) Напишіть функцію PHP, яка прийматиме два параметри: строку тексту та число. Функція повинна згенерувати динамічне
ім'я, яке буде містити слово "func" та послідовность символів, яку ми передали.

13) Напишіть анонімну функцію PHP, яка прийматиме два аргументи типу int та повертатиме суму цих двох чисел.
-->


<?php

include 'func_func.php';

myFunc();

calc(20, 30);
calc(20, 30, 5);

printStr("new str");
printHelloStr("Vasya");

printMuchStr('a', 1, 2, 43, 56, 'ff');

mergeTwoArrays([1, 2, 3, 4, 5, 6], [7, 8, 9, 10, 11, 12]);

echo '<div><a style="margin-right: 5px" href="' . goToLink('info', 'php', 'http://localhost:81/phpProject/') . '">info' . '</a></div>';


$var = 200;
echo $var;
echo getGlobalVar();
echo $var;

echo "<br>";
for ($i = 0; $i < 10; $i++) {
    echo counter();
}
echo '<br>';
print_r(creArr(3, 1, 2, 3, 4));
echo '<br>';
var_dump(creArr(3, 1, 2, 3, 4));
echo '<br>';

echo sumArr([1, 2, 4, 8]);

$var = 'dynamicFunc';
echo '<br>';
echo $var('Home', 10);


$sum = function (int $a, int $b) {
    return $a + $b;
};
echo '<br>';
echo $sum(10, 15);